# PANDAS

In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.0.3'

##
## pd.Series()
* series is a 1 dimentional data like a column in a table

In [3]:
list1=[1,2,3]
list2=["x","y","z"]
list3=[True,False,True]

In [4]:
s1=pd.Series(list1)
s2=pd.Series(list2)
s3=pd.Series(list3)

In [5]:
print(s1)
print(s2)
print(s3)

0    1
1    2
2    3
dtype: int64
0    x
1    y
2    z
dtype: object
0     True
1    False
2     True
dtype: bool

In [48]:
dict1={"Sujith":10,"Anu":29,"Ali":42}
s=pd.Series(dict1)
print(s)

Sujith    10
Anu       29
Ali       42
dtype: int64

### indexing

In [7]:
print(s1[0])
print(s2[0])
print(s3[0])

1
x
True

In [46]:
print(s["Sujith"])

10

##
## pd.dataframe()
* dataframe is a 2 dimentional data like a table.There are rows and columns in table

In [8]:
dict={"name":["Sujith","Anu","Vignesh","Sandra","Ali","Roopa","Sanal"],"wage per hr":[150,200,180,160,100,200,160],"hrs worked":[5,8,2,10,9,12,14]}

In [9]:
df1=pd.DataFrame(dict)
df1

      name  wage per hr  hrs worked
0   Sujith          150           5
1      Anu          200           8
2  Vignesh          180           2
3   Sandra          160          10
4      Ali          100           9
5    Roopa          200          12
6    Sanal          160          14

### .loc
* to locate a specific row in a data frame
* when single square bracket used( df.loc[] ),it return a sries
* when double square bracket used( df.loc[[]] ),it return a dataframe

In [10]:
print(df1.loc[1])

name           Anu
wage per hr    200
hrs worked       8
Name: 1, dtype: object

In [11]:
print(df1.loc[[1]])

  name  wage per hr  hrs worked
1  Anu          200           8

In [12]:
print(df1.loc[[0,1,2]])

      name  wage per hr  hrs worked
0   Sujith          150           5
1      Anu          200           8
2  Vignesh          180           2

##
## pd.read_csv("file_name.csv")
* To read a csv file we use pd.read_csv("file_name.csv")
* To read a json file we use pd.read_csv("file_name.json")

In [13]:
df=pd.read_csv("insurance.csv")
df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

##
## df.head()
* by default it prints first five rows

In [14]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [15]:
df.head(3)

   age     sex    bmi  children smoker     region     charges
0   19  female  27.90         0    yes  southwest  16884.9240
1   18    male  33.77         1     no  southeast   1725.5523
2   28    male  33.00         3     no  southeast   4449.4620

##
## df.tail()
* by default it prints last 5 rows

In [16]:
df.tail()

      age     sex    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [17]:
df.tail(3)

      age     sex    bmi  children smoker     region     charges
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

##
## df.info()
* Gives the summary of dataframe
* information about no.of columns,name of columns,data types,no.of rows,no.of null vallues

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

##
## Treating null values

## df.dropna()
* droping rows with null value

In [19]:
dict2=[{"name":"Sujith","wage per hr":150,"hrs worked":5},{"name":"Ali","hrs worked":5},{"name":"Anu","wage per hr":150,}
  ,{"name":"Mathew","wage per hr":170,"hrs worked":5}]

In [20]:
df2=pd.DataFrame(dict2)
df2

     name  wage per hr  hrs worked
0  Sujith        150.0         5.0
1     Ali          NaN         5.0
2     Anu        150.0         NaN
3  Mathew        170.0         5.0

In [21]:
df2_new1=df2.dropna()
df2_new1

     name  wage per hr  hrs worked
0  Sujith        150.0         5.0
3  Mathew        170.0         5.0

## df.fillna()
* filling rows with null values with 0

*method-1*

In [22]:
df2_new2=df2.fillna(0)
df2_new2

     name  wage per hr  hrs worked
0  Sujith        150.0         5.0
1     Ali          0.0         5.0
2     Anu        150.0         0.0
3  Mathew        170.0         5.0

*method-2*

In [23]:
df2_new3=df2.copy()
df2_new3["wage per hr"].fillna(100,inplace=True)
df2_new3["hrs worked"].fillna(1,inplace=True)
df2_new3

     name  wage per hr  hrs worked
0  Sujith        150.0         5.0
1     Ali        100.0         5.0
2     Anu        150.0         1.0
3  Mathew        170.0         5.0

*method-3*

In [24]:
df2_new4=df2.copy()
df2_new4.fillna({"wage per hr":100,"hrs worked":1},inplace=True)
df2_new4

     name  wage per hr  hrs worked
0  Sujith        150.0         5.0
1     Ali        100.0         5.0
2     Anu        150.0         1.0
3  Mathew        170.0         5.0

### Replacing null value with mean,median,mode

In [25]:
x=df2["wage per hr"].mean()
print(x)
y=df2["hrs worked"].mode()
print(y)

156.66666666666666
0    5.0
Name: hrs worked, dtype: float64

In [26]:
df2_new5=df2.copy()
df2_new5["wage per hr"].fillna(x,inplace=True)
df2_new5["hrs worked"].fillna(y[0],inplace=True)
df2_new5

     name  wage per hr  hrs worked
0  Sujith   150.000000         5.0
1     Ali   156.666667         5.0
2     Anu   150.000000         5.0
3  Mathew   170.000000         5.0

##
## Treating duplicates

In [27]:
df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [28]:
df.duplicated().sum()

1

### Removing duplicates
* removing duplicated rows

In [29]:
df.drop_duplicates(inplace=True)

In [30]:
df.duplicated().sum()

0

##
## Droping of rows and columns

In [31]:
dict3=[{"book_name":"A1","price":150,"rating":"5star"},{"book_name":"A2","rating":"3star"},{"book_name":"A3","price":110,}
  ,{"book_name":"A4","price":130,"rating":"4star"},{"book_name":"A5","price":120,"rating":"4star"},{"book_name":"A5","rating":"4star"}]

In [32]:
df3=pd.DataFrame(dict3)
df3

  book_name  price rating
0        A1  150.0  5star
1        A2    NaN  3star
2        A3  110.0    NaN
3        A4  130.0  4star
4        A5  120.0  4star
5        A5    NaN  4star

### droping columns

*method-1*

In [33]:
df3_new1=df3.copy()
df3_new1.drop("rating",axis=1,inplace=True)
df3_new1

  book_name  price
0        A1  150.0
1        A2    NaN
2        A3  110.0
3        A4  130.0
4        A5  120.0
5        A5    NaN

*method-2*

In [34]:
df3_new2=df3.copy()
df3_new2.drop(["price","rating"],axis=1,inplace=True)
df3_new2

  book_name
0        A1
1        A2
2        A3
3        A4
4        A5
5        A5

*method-3*

In [35]:
df3_new3=df3.copy()
list=["price","rating"]
df3_new3.drop(list,axis=1,inplace=True)
df3_new3

  book_name
0        A1
1        A2
2        A3
3        A4
4        A5
5        A5

## Droping rows

In [36]:
df3

  book_name  price rating
0        A1  150.0  5star
1        A2    NaN  3star
2        A3  110.0    NaN
3        A4  130.0  4star
4        A5  120.0  4star
5        A5    NaN  4star

*method-1*

In [37]:
df3=df3.drop(df3[df3["book_name"]=="A1"].index)
df3

  book_name  price rating
1        A2    NaN  3star
2        A3  110.0    NaN
3        A4  130.0  4star
4        A5  120.0  4star
5        A5    NaN  4star

*method-2*

In [38]:
for i in df3.index:
    if i==5:
        df3.drop(i,inplace=True)

In [39]:
df3

  book_name  price rating
1        A2    NaN  3star
2        A3  110.0    NaN
3        A4  130.0  4star
4        A5  120.0  4star

*method-3*

In [40]:
df3.drop(3,axis=0,inplace=True)
df3

  book_name  price rating
1        A2    NaN  3star
2        A3  110.0    NaN
4        A5  120.0  4star

In [41]:
df3.drop([1,2],axis=0,inplace=True)
df3

  book_name  price rating
4        A5  120.0  4star

##
## Replace values

In [42]:
df1

      name  wage per hr  hrs worked
0   Sujith          150           5
1      Anu          200           8
2  Vignesh          180           2
3   Sandra          160          10
4      Ali          100           9
5    Roopa          200          12
6    Sanal          160          14

*method-1*

In [43]:
df1_new1=df1.copy()
df1_new1.replace(160,"NOT",inplace=True)
df1_new1

      name wage per hr  hrs worked
0   Sujith         150           5
1      Anu         200           8
2  Vignesh         180           2
3   Sandra         NOT          10
4      Ali         100           9
5    Roopa         200          12
6    Sanal         NOT          14

*method-2*

In [44]:
df1_new1=df1.copy()
df1_new1["name"].replace("Ali","Aladdin",inplace=True)
df1_new1

      name  wage per hr  hrs worked
0   Sujith          150           5
1      Anu          200           8
2  Vignesh          180           2
3   Sandra          160          10
4  Aladdin          100           9
5    Roopa          200          12
6    Sanal          160          14

*method-3*

In [45]:
df1_new1.replace({"wage per hr":"NOT","hrs worked":[10,12]},"None",inplace=True)
df1_new1

      name  wage per hr hrs worked
0   Sujith          150          5
1      Anu          200          8
2  Vignesh          180          2
3   Sandra          160       None
4  Aladdin          100          9
5    Roopa          200       None
6    Sanal          160         14